#Код Морзе для представления цифр и букв использует тире и точки. Напишите
#функцию для кодирования текстового сообщения в соответствии с кодом Морзе. (словари в помощь)
text = input('Insert a string: ')
data = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '--.', 'G': '--.', 'H': '....', 'I': '...',
        'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.',
        'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--', 'Z': '--..', '0': '-----',
        '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..',
        '9': '----.'
}
def replace_text(text):
    result = ''
    key = list(data.keys())
    value = list(data.values())
    for i in range(len(text)):
        for j in range(len(key)):
            if text[i].upper() == key[j]:
                result += value[j]
        if text[i] == ' ':
            result += ' '
    return result
print(replace_text(text))
